{
  "base_game": {
    "laws": {
      "Anti-Intellectual Revolution": {
        "FOR": "After a player researches a technology, they must destroy 1 of their non-fighter ships.",
        "AGAINST": "At the start of the next strategy phase, each player chooses and exhausts 1 planet for each technology they own."
      },
      "Classified Document Leaks": {
        "FOR": "When this agenda is revealed, if there are no scored secret objectives, discard this card and reveal another agenda. The elected secret objective becomes a public objective.",
        "AGAINST": "No effect."
      },
      "Committee Formation": {
        "FOR": "The elected player gains this card. Before players vote on an agenda that requires a player to be elected, the owner of this card may discard it to choose a player to be elected.",
        "AGAINST": "No effect."
      },
      "Conventions of War": {
        "FOR": "Players cannot use BOMBARDMENT against units on cultural planets.",
        "AGAINST": "Each player that voted 'Against' discards all of their action cards."
      },
      "Core Mining": {
        "FOR": "Attach this card to the elected hazardous planet's card. Then, destroy 1 infantry on the planet. The resource value of this planet is increased by 2.",
        "AGAINST": "No effect."
      },
      "Demilitarized Zone": {
        "FOR": "Attach this card to the elected cultural planet's card. Then, destroy all units on that planet. Players cannot land, produce, or place units on this planet.",
        "AGAINST": "No effect."
      },
      "Enforced Travel Ban": {
        "FOR": "Alpha and beta wormholes have no effect during movement.",
        "AGAINST": "Destroy each PDS in or adjacent to a system that contains a wormhole."
      },
      "Executive Sanctions": {
        "FOR": "Each player can have a maximum of 3 action cards in their hand.",
        "AGAINST": "Each player discards 1 random action card from their hand."
      },
      "Fleet Regulations": {
        "FOR": "Each player cannot have more than 4 tokens in their fleet pool.",
        "AGAINST": "Each player places 1 command token from their reinforcements in their fleet pool."
      },
      "Holy Planet of Ixth": {
        "FOR": "Attach this card to the elected cultural planet's card. The planet's owner gains 1 victory point. Units on this planet cannot use PRODUCTION. When a player gains control of this planet, they gain 1 victory point. When a player loses control, they lose 1 victory point.",
        "AGAINST": "No effect."
      },
      "Homeland Defense Act": {
        "FOR": "Each player can have any number of PDS units on planets they control.",
        "AGAINST": "No effect."
      }
    },
    "directives": {
      "Armed Forces Standardization": {
        "effect": "Each player must destroy 1 infantry on each planet they control."
      },
      "Checks and Balances": {
        "effect": "The speaker loses their position. The player with the fewest victory points becomes the new speaker."
      },
      "Economic Equality": {
        "effect": "Each player redistributes their trade goods so that all players have an equal number."
      },
      "Emergency Repairs": {
        "effect": "Each player may repair all of their damaged units."
      },
      "Martial Law": {
        "effect": "Each player must place 1 infantry on each planet they control."
      },
      "Public Execution": {
        "effect": "The elected player loses all of their action cards and cannot vote on this agenda."
      },
      "Regulated Conscription": {
        "effect": "Each player may place 1 infantry on each planet they control."
      },
      "Research Grant": {
        "effect": "Each player may immediately research 1 technology."
      }
    }
  },
  "prophecy_of_kings": {
    "laws": {
      "Ixthian Artifact": {
        "FOR": "Each player may destroy all units in systems adjacent to Mecatol Rex.",
        "AGAINST": "No effect."
      },
      "Publicize Weapon Schematics": {
        "FOR": "War suns lose the SUSTAIN DAMAGE ability. Other players may ignore war sun technology prerequisites.",
        "AGAINST": "No effect."
      },
      "Shard of the Throne": {
        "FOR": "The elected player gains this card and 1 victory point. When a player gains control of a legendary planet or a planet in a home system not owned by the owner of this card, that player gains this card and 1 victory point. When a player loses this card, they lose 1 victory point.",
        "AGAINST": "No effect."
      },
      "The Crown of Emphidia": {
        "FOR": "The elected player gains this card and 1 victory point. When a player gains control of a legendary planet, they gain this card and 1 victory point. When a player loses this card, they lose 1 victory point.",
        "AGAINST": "No effect."
      },
      "Minister of War": {
        "FOR": "The elected player gains this card. The owner may perform an action to discard this card and remove 1 command token from a system on the game board.",
        "AGAINST": "No effect."
      }
    },
    "directives": {
      "Colonial Redistribution": {
        "effect": "The elected planet's controller returns it to a neutral planet. Then, the active player may place 2 infantry from their reinforcements on that planet."
      }
    }
  },
  "codex": {
    "laws": {
      "Placeholder Codex Law": {
        "FOR": "This is a placeholder for Codex-specific laws (e.g., from Codex I: Ordinian, Codex II: Affinity, or Codex III: Vigil). Specific agendas are not detailed in available sources.",
        "AGAINST": "No effect."
      }
    },
    "directives": {
      "Placeholder Codex Directive": {
        "effect": "This is a placeholder for Codex-specific directives. Specific agendas are not detailed in available sources."
      }
    },
    "notes": "The Codex releases (I, II, III) include new content such as updated technologies, promissory notes, and scenarios, but specific agenda cards are not listed in the provided references. You may need to consult the official Codex publications for complete agenda details."
  },
  "discordant_stars": {
    "laws": {
      "Placeholder Discordant Stars Law": {
        "FOR": "This is a placeholder for Discordant Stars-specific laws. The expansion includes 30 new action cards and faction-specific content, but specific agenda cards are not detailed in available sources.",
        "AGAINST": "No effect."
      }
    },
    "directives": {
      "Placeholder Discordant Stars Directive": {
        "effect": "This is a placeholder for Discordant Stars-specific directives. Specific agendas are not detailed in available sources."
      }
    },
    "notes": "Discordant Stars is a fan-made expansion requiring Prophecy of Kings, adding 34 new factions and 30 new action cards. Specific agenda cards are not listed in the provided references. You may need to consult the Discordant Stars Rules Clarification Document or the TI4 Homebrew Hub Discord for complete agenda details."
  }
}